[
  {
    "_class": "course",
    "id": 50522,
    "title": "Become Exceptional in HTML and HTML5",
    "url": "/course/become-exceptional-in-html-html5/",
    "image_240x135": "https://img-c.udemycdn.com/course/240x135/50522_ffee_4.jpg",
    "description": "<p>  \t Hi friends, Debayan here. We live in the age of technology and knowledge. Earlier people would find it hard to comprehend the thought of internet and web-sites. But now, no can imagine a life without Internet. Connection to other people is not crucial for social life but also for your business and overall growth. But Have you ever wondered how and where from it all started. The answer my friends is <strong style=\"\"><em style=\"\">HTML</em></strong>.  </p>  <p>  \t Using this course, you will not only understand the ins and outs of HTML, but also the new HTML5 standards. You will also be introduced to the professional development strategy for web-development. Even from a Novice to Professional can use this course to become  <strong style=\"\">Exceptional </strong>in web-development. In this course, you will get the all concepts and knowledge of both HTML and HTML5.  </p>  <p>  \t  There are two sections, one for HTML and other for HTML5, where all the concepts are discussed. The course involves the following lessons:  </p>  <p>  \t <strong style=\"\">Section One: HTML</strong>  </p>  <ul style=\"\">  \t<li>HTML History and Benefit</li>  \t<li>HTML Terms and Definitions</li>  \t<li>HTML Tags, Attributes and Elements</li>  \t<li>All HTML Core Tags</li>  </ul>  <p>  \t <strong style=\"\">Section Two: HTML5</strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\"></strong>New Semantic Tags</li>  \t<li>Canvas</li>  \t<li>SVG</li>  \t<li>Audio Tags</li>  \t<li>Video Tags</li>  \t<li>Drag and Drop</li>  \t<li>Geolocation</li>  \t<li>Web-Storage</li>  \t<li>App Cache</li>  \t<li>Web-Workers</li>  \t<li>SSE</li>  </ul>  <p>  \tThis is a 6+ hours course, so please take the course at your own time. Once you complete this course, you will not only be proficient in HTML and HTML5, but also will know ready to take on any web development challenge on your way to glory.  </p>",
    "headline": "The BLUEPRINT for web-development",
    "num_quizzes": 0,
    "num_lectures": 34
  },
  {
    "_class": "course",
    "id": 3792262,
    "title": "The Git & Github Bootcamp",
    "url": "/course/git-and-github-bootcamp/",
    "image_240x135": "https://img-c.udemycdn.com/course/240x135/3792262_6b0c_2.jpg",
    "description": "<p>The following sentence is annoying, but also true: <strong>the best time to learn Git was yesterday</strong>. Fortunately, the second best time is today!&nbsp; Git is an essential tool for work in any code-related field, from data science to game development to machine learning.&nbsp; This course covers everything you need to know to start using Git and Github in the real-world today!</p><p>The course's 20+ sections are broken down into four separate units:</p><ul><li><p><strong>Git Essentials </strong></p></li><li><p><strong>Next Level Git</strong></p></li><li><p><strong>Github &amp; Collaboration</strong></p></li><li><p><strong>The Tricky Bits</strong></p></li></ul><p>We start off with <strong>Git Essentials.</strong>&nbsp; The goal of this unit is to give you all the essential Git tools you need for daily use.&nbsp; We start off talking about version control software, what it is, why it matters, and the history of Git.&nbsp; Then we install Git and run through the Unix commands you'll need to work with Git (you can skip this if you're already familiar).&nbsp; The bulk of this unit is focused on teaching the core Git mechanics like <strong>committing </strong>and <strong>branching</strong> and the associated concepts: the working directory, the repository, the staging area, etc.&nbsp; &nbsp; We cover Git commands including: git init, git add, git commit, git status, git log, git branch, and git merge.&nbsp; We end with a detailed look at branching, <strong>merging</strong>, and <strong>resolving conflicts</strong>. </p><p>Then we move on to out <strong>Next Level Git </strong>unit, where we cover additional commands and Git concepts that are extremely useful, but maybe not as \"core\" as the Git Essentials.&nbsp; We start with a comprehensive look at the <strong>gif diff</strong> command and the various comparisons that we can make between commits, branches, the working directory, the staging area, and more!&nbsp; We pay special attention to reading and parsing the dense output generated by diffs.&nbsp; Then we shift our focus to stashing with the <strong>git stash </strong>command, a \"convenience command\" that many users love incorporating into their Git workflow.&nbsp; Finally, we dive deep into <strong>undoing changes and time traveling</strong> with Git.&nbsp; We learn how to revisit earlier work, detach and re-attach HEAD, and discard changes.&nbsp; We cover git commands that help us undo changes including <strong>git checkout</strong>, <strong>git restore</strong>, <strong>git reset</strong>, and <strong>git revert</strong>.</p><p>Next up, we change gears to focus on <strong>Github &amp; Collaboration</strong>.&nbsp; We start by exploring Github (and similar tools) that host remote repositories and discussing the benefits they provide.&nbsp; We create our own Github repositories and sync up changes between our remote and local repositories using the <strong>git push</strong>, <strong>git pull</strong>, and <strong>git fetch</strong> commands.&nbsp; We then focus on commonly used <strong>collaboration workflows</strong> that students may encounter in the real world: <strong>feature branching</strong>, <strong>pull requests</strong>, <strong>forking &amp; cloning</strong>, and more! We discuss <strong>contributing to open source </strong>projects and configuring Github repositories for collaboration. We also spend some time learning about useful Github features including Github <strong>Gists </strong>and <strong>Github Pages</strong> for free static hosting.</p><p>The last unit in the course, <strong>The Tricky Bits</strong>, is really just a collection of useful Git command and advanced topics.&nbsp; We start by covering one of the \"scarier\" Git commands: <strong>rebasing</strong>!&nbsp; We discuss the potential benefits and pitfalls of rebasing and compare it to merging.&nbsp; Then we learn how to clean up our Git history by rewording, editing, dropping, and <strong>squashing</strong> commits using the <strong>interactive rebase</strong> command.&nbsp; Next, we discuss <strong>Git tags</strong> (lightweight and <strong>annotated tags</strong>) semantic versioning and tagging workflows.&nbsp; After that, we move on to a deep dive into the inner workings of Git.&nbsp; We discuss the files and folders Git uses internally, the role of <strong>hashing</strong> functions in Git, and the role of Git objects (<strong>blobs</strong>, <strong>trees</strong>, etc.). Next, we talk about reference logs and the <strong>git reflog</strong> command.&nbsp; Specifically, we learn how we can use reflogs to rescue \"lost\" commits and <strong>undo rebases</strong>.&nbsp; Finally, we learn how to write custom and powerful <strong>Git aliases</strong>!</p><p>Throughout the course, you'll find tons and tons of diagrams and visual references I've created to try and explain Git.&nbsp; The course also includes exercises I've tested on my in-person students, to give you an opportunity to practice the concepts in the course along the way.&nbsp; If you are reading this sentence, I congratulate you on making it this far :) I&nbsp;hope you enjoy the course!</p>",
    "headline": "Master the essentials and the tricky bits: rebasing, squashing, stashing, reflogs, blobs, trees, & more!",
    "num_quizzes": 1,
    "num_lectures": 187
  },
  {
    "_class": "course",
    "id": 2034156,
    "title": "Build a Blockchain & Cryptocurrency | Full-Stack Edition",
    "url": "/course/build-blockchain-full-stack/",
    "image_240x135": "https://img-c.udemycdn.com/course/240x135/2034156_1187.jpg",
    "description": "<p>White walkers stalking you in the night?<em> Death eaters knocking down your door?</em></p><p><br></p><p><strong>Well, sounds like you’re looking to build a blockchain and cryptocurrency!</strong> Having your own blockchain and cryptocurrency is the number one way to get rid of threats both <em>magical and technical!</em></p><p>Ok, maybe the magic part was a tiny bit exaggerated. But the technical part, not so much! The blockchain has become a magic bullet in the software world throughout the past few years. It’s proven that it has the power to revolutionize economic systems and so much more. It seems to have the power to save us all.</p><p>But the blockchain wave has only begun! There is so much untapped potential in the field for high-paying employment, and new exciting companies.</p><p>But it all starts with building a blockchain and cryptocurrency? How are you going to do that? Take this course!</p><p><br></p><p><strong><em>Why this course specifically?</em></strong></p><p>This course will teach you how to build your own blockchain and cryptocurrency<strong> <em>from scratch</em>. You’ll have your own full-on backend, test suite, frontend and deployment process.</strong></p><p>It’s no denying that blockchain based systems have taken the tech and financial worlds by storm. A single bitcoin was worth $20,000 at one point in one 2017. And beyond cryptocurrencies, the potential use cases for the blockchain are truly endless. <strong>And yet the blockchain industry is still so young. So many startups waiting to, well, <em>start up!</em></strong></p><p><strong>So it’s time to create your own unique blockchain project. </strong>Take this course to gain the foundation to do so. Other courses may teach how the blockchain works, its main concepts, or how to invest in a cryptocurrency. <strong>But this is the best resource for you to learn how to make a blockchain from scratch, and apply your own unique ideas on top of that.</strong></p><p><br></p><p>In this course, you will:</p><p><strong>Build a full on blockchain and cryptocurrency backend.</strong> Create and code blockchain objects. Implement the core logic to power the blockchain. Learn the essential concepts behind the powerful ideas of blockchain technology.</p><p><strong>Write a full test suite and code in a test-driven manner. </strong>You will also have the chance to make your implementation truly unique. If your own code covers the test cases, your blockchain will be both unique and functional.</p><p><strong>Create a frontend application. </strong>Your project will have a web app that will allow people from all over the world to use your blockchain and cryptocurrency. If you’re a fan of React, you’ll love the frontend part of this course.</p><p><strong>Finally, you will deploy the project in a public environment. </strong>A lot of coding courses will take you as far as the local application. But only a select few take you to the next level. This is one of those courses. You will take publish your project. And anyone in the world will be able to use it, as long as they know your project’s url. </p><p>On top of building a full backend, testing suite, a frontend web app, and deploying the project, there are many other aspects of the course to look forward to:</p><p><strong>A deep conceptual understanding backed by practical experience. </strong>You will see the big picture of core blockchain and cryptocurrency concepts. And those big picture concepts will be reinforced directly by building related features in code. You will find a balance of theory and practical experience in the course.</p><p><strong>You will learn work with many technologies. </strong>Node.js, JavaScript, Express, APIs, Publish/Subscribe, React.js - all these technologies will be incorporated in the full-stack project. Don’t worry if you’re a beginner to any. Each keyword/concept will be explained - even the fundamental JavaScript. That being said, this course is best for intermediate students - anyone who knows at least one programming language already!</p><p><strong>Software Best Practices.</strong> You will follow all the modern best practices of full-stack development. Learn the conventions of Node.js and React, and how to properly structure code and projects. As a practicing software engineer, I’ve applied the same level of care to the project course code as I would to code that I ship every day in my full-time job.</p><p><br></p><p>***</p><p><br></p><p>Question(s) you may have:</p><p><strong><em>What is the difference between this course and your original course on building a blockchain and cryptocurrency?</em></strong></p><p>This is a remastered version of that original course. The original course does not have a frontend nor a deployment process. So many students were looking for these aspects from that first course. Well, you’ll find that here!</p><p>Plus, the refactored test-driven backend will give you the opportunity to truly create your own version of the project. The first course went with the code and core logic first. Then the tests came after. This approach does not give as much immediate freedom to implement the functions and logic in your own unique way.</p><p>Also, a lot of the blockchain logic has been improved, with additional methods and concepts! This version of the project is definitely more secure, more thorough, and more complete.</p><p><br></p><p><strong><em>Can this course help me find employment?</em></strong></p><p><strong>Taking this course will turn you into both a software engineer, and a specialized blockchain engineer. </strong>This position is a new one in the software industry. And the demand is high. But the supply is low. So open a ton of doors by becoming an in-demand engineer with a fully deployed blockchain and cryptocurrency on your resume!</p><p><br></p><p>***</p><p>Ultimately, this course is a learning experience like no other. It’s an opportunity to become a pioneer in such a young and promising field!</p><p>So, are you going to let this golden chance pass you by? Heck no! Join the course, and let’s get starting coding a full-on blockchain and cryptocurrency!</p><p><br></p>",
    "headline": "Full-stack blockchain programming course! A backend + frontend with Node.js, Jest, Express, React, Heroku, & more!",
    "num_quizzes": 0,
    "num_lectures": 125
  },
  {
    "_class": "course",
    "id": 1594488,
    "title": "Blockchain A-Z™: Learn How To Build Your First Blockchain",
    "url": "/course/build-your-blockchain-az/",
    "image_240x135": "https://img-b.udemycdn.com/course/240x135/1594488_69b9.jpg",
    "description": "<p><strong>*** AS SEEN ON KICKSTARTER ***</strong></p>\n\n<p>Learn key Blockchain concepts, intuition and practical training to get you quickly up to speed with all things Crypto and Blockchain related. Covering:\n</p>\n\n\n\n<ul><li><strong>Module 1: </strong>How to<strong> build a Blockchain </strong>- we'll start at the very beginning</li><li><strong>Module 2: </strong>How to <strong>create a Cryptocurrency</strong> - the next step of your journey</li><li><strong>Module 3: </strong>How to<strong> create a Smart Contract </strong>- Let's cross the finish line</li></ul>\n\n\n\n<p>Here is what you will get with this course:</p>\n\n\n\n\n\n<p><strong></strong></p>\n\n<p><strong>1. From novice to Blockchain expert: </strong>The #1 criteria for success in anything is to be fascinated. If you combine your interest in Blockchain with this training, you’ve got everything you need to become an expert in the field - even if you’re unsure where to begin.  </p>\n\n\n\n<p><strong>2. A focus on doing, not just listening: </strong>The best way to reinforce a skill is to practice it yourself, and blockchain is no different. Not only we’ll each and every single line of code, but we will also take regular steps back to see the logical flow of our creations. </p>\n\n\n\n<p><strong>3. The guide to intuitive understanding: </strong>In this course you will not only develop the required skills and deep knowledge about Blockchain, but you will also get the right tech instincts. Through this intuition you will feel where and how to apply Blockchain in the real world.</p>\n\n\n\n<p><strong>4. Real-world applications: </strong>The projects you’ll develop provide the perfect starting point to rapidly gain expertise. Everything you build and practice will be an exciting journey with real-world impact. When finished, you’ll be 100% ready to apply your skills to anything Blockchain-related.  </p>\n\n\n\n<p><strong>5. In-course support –</strong> We’re fully committed to making this the most accessible and results-driven Blockchain course on the planet. This requires us to be there when you need our help. That’s why we’ve put together a team of professional Data Scientists to support you in your journey, meaning you’ll get a response from us within 48 hours maximum.</p>",
    "headline": "Harness the power of the most disruptive technology since the internet through real life examples! Master Blockchain Now",
    "num_quizzes": 4,
    "num_lectures": 104
  },
  {
    "_class": "course",
    "id": 1329100,
    "title": "Progressive Web Apps (PWA) - The Complete Guide",
    "url": "/course/progressive-web-app-pwa-the-complete-guide/",
    "image_240x135": "https://img-c.udemycdn.com/course/240x135/1329100_571a.jpg",
    "description": "<p><strong>Progressive Web Apps</strong> (PWAs) are the next big thing in web development as they bring <strong>mobile-app-like experiences</strong> to your users without requiring them to install an app from the app store/&nbsp;play store.</p><p>You still create a web application (HTML,&nbsp;CSS, JavaScript)&nbsp;but this course will teach you how to add features such as <strong>camera access, service workers for offline support, push notifications and more</strong>. This combines the best of both worlds:&nbsp;You deliver fast, engaging and reliable experiences whilst still having the reach and accessibility of a web page.</p><p>\"Progressive Web App\" simply is a term summarizing all the features allowing you to deliver mobile-like experiences. The topic is <strong>highly trending and it also is a topic&nbsp;which is here to stay</strong>!&nbsp;Not only is it strongly promoted by Google (actually a lot of talks at Google I/O 2017, Google's developer conference, were devoted to PWAs), it's also quickly being adopted by big companies like <strong>Twitter</strong> or the <strong>Washington Post</strong>.</p><p>Having the skills to build and optimize these kind of web apps is already an&nbsp;important and highly demanded skill for modern web developers, a trend which is only going to accelerate! Therefore, learning how to build PWAs will give you a competitive edge!</p><p>In detail, this course will cover <strong>everything you need </strong>to build amazing PWAs - leading to a score of 100 (out of 100)&nbsp;in Google's PWA&nbsp;auditing tool \"Lighthouse\":</p><ul><li><p>Detailed <strong>explanation </strong>about what&nbsp;a PWA&nbsp;exactly is</p></li><li><p>How to use an app manifest to make your web app&nbsp;<strong>installable on device homescreens</strong></p></li><li><p>Using <strong>service workers</strong> to offer <strong>offline </strong>support by caching assets</p></li><li><p>Advanced service worker usage and<strong> caching strategies</strong></p></li><li><p>A refresher on <strong>Promises</strong> and the <strong>Fetch API </strong>as both concepts are heavily used in PWAs</p></li><li><p>How to improve user engagement by adding<strong> push notifications</strong></p></li><li><p>A way to <strong>synchronize data</strong> in the background, even if connection is lost</p></li><li><p>How to access native device features like the <strong>camera </strong>or <strong>geolocation</strong></p></li><li><p>Using <strong>Workbox </strong>to make service worker management easier</p></li><li><p>Explanations on how to turn your next <strong>SPA&nbsp;project into a PWA</strong></p></li><li><p>And more</p></li></ul><p>All these things are of course put into practice by building a<strong> course project</strong>. To ensure that you can apply the knowledge to ANY&nbsp;of your projects, the course project doesn't assume any JavaScript framework but focuses on the core features mentioned above!</p><p><strong>So this course has a lot to offer, how do you tell if it's for you though?</strong></p><p>It definitely is the right choice if ...</p><ul><li><p>... you already are a web developer (no matter if experienced or still new to the business)&nbsp;and want to prepare for the future</p></li><li><p>... you enjoy working with HTML,&nbsp;CSS&nbsp;and JavaScript and want to leverage the full power the web and browser technologies have to offer</p></li><li><p>... you want to deliver the best possible experiences to your users, using technologies like web push&nbsp;notifications or offline support</p></li></ul><p><strong>What do you need to know to get the most out of the course?</strong></p><ul><li><p>You need to know at least the basics of HTML,&nbsp;CSS&nbsp;and JavaScript</p></li><li><p>No advanced knowledge of these technologies required though</p></li><li><p>You DON'T need to know any JavaScript framework like Angular or React - PWAs work with ANY JavaScript app, even if you don't use a framework at all&nbsp;(actually, that's what we'll build in the course!)</p></li></ul><p>I'd be very happy to welcome you on board of this course and start this journey together with you!</p><p>Max</p>",
    "headline": "Build a Progressive Web App (PWA) that feels like an iOS & Android App, using Device Camera, Push Notifications and more",
    "num_quizzes": 1,
    "num_lectures": 211
  },
  {
    "_class": "course",
    "id": 3138058,
    "title": "Deno: The Complete Guide Zero to Mastery",
    "url": "/course/deno-the-complete-guide-zero-to-mastery/",
    "image_240x135": "https://img-c.udemycdn.com/course/240x135/3138058_45fe_2.jpg",
    "description": "<p><strong>Just released with all the latest Deno features for you to become a complete Deno developer!</strong> <strong>Join a live online community of over 600,000+ developers and a course taught by industry experts that have actually worked both in Silicon Valley and Toronto. </strong>Using the latest release of Deno, this course is focused on efficiency. Never spend time on confusing, out of date, incomplete tutorials anymore. <strong>Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies. </strong></p><p>We guarantee you this is the most comprehensive online resource on Deno. This project based course will introduce you to all of the modern toolchain of a Deno developer in 2022. Along the way, we will build a strong foundation learning the pitfalls of Node.js, how Deno is different, and some of the ways we can still maintain the power we had with Node.js.</p><p><strong>The curriculum is going to be very hands on as we walk you from start to finish of releasing a professional Deno project all the way into production.</strong>&nbsp;We will start from the very beginning by teaching you Deno basics and then going into advanced topics so you can make good decisions on architecture and tools on any of your future Deno projects. </p><p><strong>All code is going to be provided step by step and even if you don’t like to code along, you will get access to the full master project code so anyone signed up for the course will have their own project to put on their portfolio right away.<br></strong></p><p>The topics covered in this course are:</p><p><strong>- Deno Fundamentals</strong></p><p><strong>- Deno vs NodeJS</strong></p><p><strong>- Scripting with Deno</strong></p><p><strong>- Modules and Dependency Management with Deno</strong></p><p><strong>- Testing, Building, Debugging&nbsp;Deno Apps</strong></p><p><strong>- Error Handling</strong></p><p><strong>- Deno Developer Environment</strong></p><p><strong>- Deploying Deno Apps to production (AWS + Docker)</strong></p><p><strong>- Securing your Backend applications</strong></p><p><strong>- File Processing with Deno</strong></p><p><strong>- Web Development with Deno</strong></p><p><strong>-&nbsp;Working with and building RESTful APIs with Deno</strong></p><p><strong>- TypeScript</strong></p><p><strong>- How JavaScript works internally</strong></p><p><strong>- Deno architecture and runtime</strong></p><p><strong>- Performance and scalability when it comes to server side programming</strong></p><p><strong>+more</strong></p><p><br></p><p>That’s right. This brand new course will not only teach you the basics of Deno, but it will also teach you the latest features, advanced features, ecosystem, and tools, as well as show you how to build professional scale apps using Deno that most tutorials shy away from.</p><p><strong>We believe that Deno is the future and the early investment now by those who are early adopters, will pay off greatly in the future. Imagine learning Node JS or React when they first came out. Imagine the advantage you would have had. </strong>We are excited about Deno and you should be too because it will change the Javascript world over the next couple of years.</p><p><br></p><p>Let me tell you 3 reasons why this course is unlike anything out there:</p><p><strong>1. You will build the biggest project you will find out there using Deno</strong>. We will be using best practices where we take performance, scalability and security in mind to build production ready space launch system app . Let’s just say we don’t shy away from the advanced topics.</p><p><br></p><p><strong>2.</strong> This course is taught by 2 instructors that have actually worked for some of the biggest tech firms in the world. Adam has been working as a tech lead for backend systems for top companies with revenues exceeding $50 billion, including on projects like Tesla Power Wall and Blackberry. <strong>He is also an official Deno contributor.</strong> I’m Andrei. I’ve worked for large IPOed tech firms in Silicon Valley as well as Toronto and some of my past students work at places like Google and Amazon. By having both of us teach, you get to see different perspective and learn from 2 senior developers as if we are working at a company together.</p><p><br></p><p><strong>3. This course will be constantly evolving and updating as the landscape changes.</strong> Just as the Deno ecosystem evolves, we want this course to be constantly updated with lectures and resource for you to come back to, in order to find the latest Deno best practices.</p><p><br></p><p>So will Deno replace Node? Nobody can predict the future...but we are willing to bet that those who invest their time into Deno will reap the benefits in the coming years.</p><p><br><strong>Click ENROLL&nbsp;NOW and see you inside the course!</strong></p><p><br></p><p><br></p><p><strong>Taught By:<br></strong></p><p>Andrei is the instructor of the <strong>highest rated Development courses on Udemy as well as one of the fastest growing. </strong>His graduates have moved on to work for some of the biggest tech companies around the world like Apple, Google, Tesla, Amazon, JP Morgan, IBM, UNIQLO etc... He has been working as a senior software developer in Silicon Valley and Toronto for many years, and is now taking all that he has learned, to teach programming skills and to help you discover the amazing career opportunities that being a developer allows in life.</p><p>Having been a self taught programmer, he understands that there is an overwhelming number of online courses, tutorials and books that are overly verbose and inadequate at teaching proper skills. Most people feel paralyzed and don't know where to start when learning a complex subject matter, or even worse, most people don't have $20,000 to spend on a coding bootcamp. <strong>Programming skills should be affordable and open to all. An education material should teach real life skills that are current and they should not waste a student's valuable time.</strong> Having learned important lessons from working for Fortune 500 companies, tech startups, to even founding his own business, he is now dedicating 100% of his time to teaching others valuable software development skills in order to take control of their life and work in an exciting industry with infinite possibilities.</p><p>Andrei promises you that there are no other courses out there as comprehensive and as well explained. <strong>He believes that in order to learn anything of value, you need to start with the foundation and develop the roots of the tree. Only from there will you be able to learn concepts and specific skills(leaves) that connect to the foundation. Learning becomes exponential when structured in this way.</strong></p><p>Taking his experience in educational psychology and coding, Andrei's courses will take you on an understanding of complex subjects that you never thought would be possible.</p><p><br></p><p>-------</p><p><br>Adam is one of the instructors at Zero To Mastery, one of the highest rated and fastest growing software development academies on Udemy. He has been working as a senior software developer for many years and has worked for some of the top companies in the world with revenues exceeding $50 billion. Now, Adam aims to instil his students with his <strong>love for learning and development</strong>, while helping them achieve real world success that extends far beyond the completion of his courses.</p><p>Adam walks the walk when it comes to building applications that are secure, scalable, and performant and he is going to share his expertise with you to show you <strong>how real world systems are built</strong>. He understands what it’s like to go from “hello world” to large scale production deployments and promises to take you on that very same journey. Courses should teach practical skills that are current and should <strong>lay a foundation</strong> for a future in this incredible and exciting industry. And, having started as a self-taught developer, Adam knows the overwhelming feeling of not knowing where to begin, and the importance of learning from the best available sources.</p><p>Drawing from his deep experience, Adam’s courses will show you that you don’t need to spend tens of thousands of dollars to <strong>take your flourishing skills into the real world and make a difference</strong>.</p>",
    "headline": "Master Deno and learn to build professional scale Deno apps! The must learn technology of 2022 for JavaScript developers",
    "num_quizzes": 2,
    "num_lectures": 177
  },
  {
    "_class": "course",
    "id": 851712,
    "title": "The Complete JavaScript Course 2022: From Zero to Expert!",
    "url": "/course/the-complete-javascript-course/",
    "image_240x135": "https://img-c.udemycdn.com/course/240x135/851712_fc61_6.jpg",
    "description": "<p><strong><em>***&nbsp;The #1 bestselling JavaScript&nbsp;course on Udemy! ***</em></strong></p><p><strong><em>*** Just updated for latest ES2021 and ES2022 features ***</em></strong></p><p><em>\"Really, really well made course. Super in-depth, with great challenges and projects that will solidify your Javascript understanding. I found the lectures were paced perfectly -- Jonas doesn't skip over anything that might be useful to a JS developer\"</em> — Carson Bartholomew</p><p><br></p><p>JavaScript is the most popular programming language in the world. It powers the entire modern web. It provides millions of high-paying jobs all over the world.</p><p>That's why you want to learn JavaScript too. And you came to the right place!</p><p><br></p><p><strong>Why is this the right JavaScript course for you?</strong></p><p><em>This is the most complete JavaScript course on Udemy. It's an all-in-one package that will take you from the very fundamentals of JavaScript, all the way to building modern and complex applications.</em></p><p>You will learn modern JavaScript from the very beginning, step-by-step. I will guide you through <strong>practical and fun code examples</strong>, <strong>important theory</strong> about how JavaScript works behind the scenes, and <strong>beautiful and complete projects</strong>.</p><p>You will also learn how to think like a developer, how to plan application features, how to architect your code, how to debug code, and a lot of other real-world skills that you will need on your developer job.</p><p>And unlike other courses, this one actually contains beginner, intermediate, advanced, and even expert topics, so <strong>you don't have to buy any other course in order to master JavaScript</strong> from the ground up!</p><p>But... You don't have to go into all these topics. This is a huge course, because, after all, it's \"The Complete JavaScript Course\". In fact, it's like many courses in one! <strong>But you can become an excellent developer by watching only parts of the course</strong>. That's why I built this course in a very modular way, and designed pathways that will take you through the course faster.</p><p><em>By the end of the course, you will have the knowledge and confidence that you need in order to ace your job interviews and become a professional developer.</em></p><p><br></p><p><strong>Why am I the right JavaScript teacher for you?</strong></p><p>My name is Jonas, I'm an experienced web developer and designer, and one of Udemy's top instructors. I have been teaching this bestselling course since 2016 to over 400,000 developers, always listening to feedback and understanding exactly how students actually learn.</p><p>Recently, I took all my teaching experience to build this new and greatly improved JavaScript course. It's now the best and most in-depth JavaScript course that you will find on Udemy (and maybe the entire internet).</p><p>I know how students learn JavaScript and what they need in order to master it. And with that knowledge, I designed the ideal course curriculum. <strong>It's a unique blend of real-world projects, deep explanations, theory lectures, and challenges</strong>, that will take you from zero to an expert and confident JavaScript developer in just a couple of weeks.</p><p><br></p><p><strong>So what exactly is covered in the course?</strong></p><ul><li><p>Build 5 beautiful real-world projects for your portfolio! In these projects, you will learn how to plan and architect your applications using flowcharts and common JavaScript patterns</p></li><li><p>Master the JavaScript fundamentals: variables, if/else, operators, boolean logic, functions, arrays, objects, loops, strings, and more</p></li><li><p>Learn modern JavaScript (ES6+) from the beginning: arrow functions, destructuring, spread operator, default arguments, optional chaining (ES2020), and more</p></li><li><p>How JavaScript works behind the scenes: engines, the call stack, hoisting, scoping, the 'this' keyword, reference values, and more.</p></li><li><p>Deep dive into functions: arrow functions, first-class and higher-order functions, bind, and closures.</p></li><li><p>Deep dive into object-oriented programming: prototypal inheritance, constructor functions (ES5), classes (ES6), encapsulation, abstraction, inheritance, and polymorphism. [This is like a small standalone course]</p></li><li><p>Deep dive into asynchronous JavaScript: the event loop, promises, async/await, and error handling. You will use these to access data from third-party APIs with AJAX calls. [This is like a small standalone course]</p></li><li><p>Learn modern tools that are used by professional web developers: NPM, Parcel (module bundler), Babel, and ES6 modules</p></li></ul><p>Check out the course curriculum for an even more detailed overview of the content :)</p><p><br></p><p><strong>This is what's also included in the package:</strong></p><ul><li><p>Up-to-date HD-quality videos, that are easy to search and reference (great for Udemy for Business students)</p></li><li><p>Professional English captions (not the&nbsp;auto-generated ones)</p></li><li><p>Downloadable starter code and final code for each section</p></li><li><p>Downloadable slides for 40+ theory videos (not boring, I promise!)</p></li><li><p>Free support in the course Q&amp;A</p></li><li><p>25+ coding challenges and 25+ assignments to practice your new skills (solutions included)</p></li></ul><p><br></p><p><strong>This course is for you if...</strong></p><ul><li><p>... you want to gain a true and deep understanding of JavaScript</p></li><li><p>... you have been trying to learn JavaScript but: 1) still don't really understand JavaScript, or 2) still don't feel confident to code real apps</p></li><li><p>... you are interested in using a library/framework like React, Angular, Vue, or Node.js in the future</p></li><li><p>... you already know JavaScript and are looking for an advanced course. This course includes expert topics!</p></li><li><p>... you want to get started with programming: JavaScript is a great first language!</p></li></ul><p><br></p><p><strong>Does any of these look like you? If so, then start this adventure today, and join me and 400,000+ other developers in the only JavaScript course that you will&nbsp;ever need!</strong></p>",
    "headline": "The modern JavaScript course for everyone! Master JavaScript with projects, challenges and theory. Many courses in one!",
    "num_quizzes": 2,
    "num_lectures": 486
  },
  {
    "_class": "course",
    "id": 2365628,
    "title": "Complete React Developer in 2022 (w/ Redux, Hooks, GraphQL)",
    "url": "/course/complete-react-developer-zero-to-mastery/",
    "image_240x135": "https://img-c.udemycdn.com/course/240x135/2365628_0b60_9.jpg",
    "description": "<p><strong>Just FULLY updated and re-recorded with all new React features for 2022 (React v18)! Join a live online community of over 600,000+ developers and a course taught by industry experts that have actually worked both in Silicon Valley and Toronto with React.js.</strong> <br><br>Using the latest version of React <em>(React 18)</em>, this course is focused on efficiency. Never spend time on confusing, out of date, incomplete tutorials anymore. <strong>Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies.</strong></p><p>We guarantee you this is the most comprehensive online resource on React. This project based course will introduce you to all of the modern toolchain of a React developer in 2022. Along the way, we will build a massive e-commerce application similar to Shopify using React, Redux, React Hooks, React Suspense, React Router, GraphQL, Context API, Firebase, Redux-Saga, Stripe + more. This is going to be a full stack app (MERN stack), using Firebase.</p><p>The curriculum is going to be very hands on as we walk you from start to finish of releasing a professional React project all the way into production.&nbsp;We will start from the very beginning by teaching you React Basics and then going into advanced topics so you can make good decisions on architecture and tools on any of your future ReactJS projects. </p><p>All code is going to be provided step by step and even if you don’t like to code along, you will get access to the the full master project code so anyone signed up for the course will have their own project to put on their portfolio right away.<br><br>The topics covered will be:</p><p><strong>- React Basics</strong></p><p><strong>- React Router</strong></p><p><strong>- Redux</strong></p><p><strong>- Redux&nbsp;Saga</strong></p><p><strong>- Asynchronous Redux</strong></p><p><strong>- React Hooks</strong></p><p><strong>- Context API</strong></p><p><strong>- React Suspense + React Lazy</strong></p><p><strong>- Firebase</strong></p><p><strong>-&nbsp;Stripe API</strong></p><p><strong>- Styled-Components</strong></p><p><strong>- GraphQL</strong></p><p><strong>- Apollo</strong></p><p><strong>- PWAs</strong></p><p><strong>- React Performance</strong></p><p><strong>- React Design Patterns</strong></p><p><strong>- Testing with Jest, Enzyme and Snapshot testing</strong></p><p><strong>- React Best Practices</strong></p><p><strong>- Persistance + Session Storage</strong></p><p><strong>- State Normalization</strong></p><p><strong>+ more</strong></p><p><br></p><p>Wait wait… I know what you’re thinking. Why aren’t we building 10+ projects? Well, here’s the truth: Most courses teach you React and do just that. They show you how to get started, build 10 projects that are simple and easy to build in a day, and just add some CSS to make them look fancy. In real life though, you’re not building silly applications. When you apply to jobs, nobody is going to care that you built a really pretty To Do app. Employers want to see you build large apps that can scale, that have good architecture, and that can be deployed to production.</p><p><br></p><p><strong>Let me tell you 3 reasons why this course is different from any other React tutorial online:</strong></p><p><br></p><p><strong>1</strong>. You will build the biggest project you will see in any course. This type of project would take you months to implement yourself.</p><p><br></p><p><strong>2.</strong> This course is taught by 2 instructors that have actually worked for some of the biggest tech firms using React in production. Yihua has been working on some of the biggest e-commerce websites that you have definitely heard of and probably have shopped at. Andrei has worked on enterprise level React applications for large IPOed tech firms in Silicon Valley as well as Toronto. By having both of them teach, you get to see different perspective and learn from 2 senior developers as if you are working at a company together.</p><p><br></p><p><strong>3.</strong> We learn principles that are important beyond just what you learn as a beginner. Using the instructor's experiences you learn about design patterns, how to architect your app, organize your code, structure your folders, and how to think about performance. Let’s just say we don’t shy away from the advanced topics.</p><p><br></p><p>This course is not about making you just code along without understanding the principles so that when you are done with the course you don’t know what to do other than watch another tutorial. No! <strong>This course will push you and challenge you to go from an absolute beginner in React to someone that is in the top 10% of React developers.&nbsp;</strong></p><p><br></p><p><strong>Taught By:<br></strong></p><p>Andrei&nbsp;Neagoie is the instructor of the <strong>highest rated Development courses on Udemy as well as&nbsp;one of the fastest&nbsp;growing.&nbsp;</strong>His graduates have&nbsp;moved&nbsp;on to work for&nbsp;some of the biggest tech&nbsp;companies around the world like Apple, Google, Amazon, JP Morgan, IBM, UNIQLO etc...&nbsp;He&nbsp;has&nbsp;been working as a senior software developer in&nbsp;Silicon Valley and Toronto for many years,&nbsp;and&nbsp;is now taking all that he has learned,&nbsp;to teach&nbsp;programming skills and&nbsp;to help you&nbsp;discover the amazing career opportunities that being a developer allows in&nbsp;life.&nbsp;</p><p>Having been&nbsp;a self taught programmer,&nbsp;he understands that there is an&nbsp;overwhelming number of online courses, tutorials and books&nbsp;that are overly verbose and inadequate at teaching proper skills.&nbsp;Most people feel paralyzed and don't know where to start when learning a complex subject matter, or even worse, most people don't have $20,000 to spend on a coding bootcamp.&nbsp;<strong>Programming skills should be affordable and open to all. An education material&nbsp;should teach real life skills that are current and&nbsp;they should not waste a student's valuable time.</strong>&nbsp;&nbsp; Having learned important&nbsp;lessons from working for Fortune 500 companies, tech startups, to even&nbsp;founding his own business, he is now dedicating 100% of his time to&nbsp;teaching others valuable&nbsp;software development skills&nbsp;in order to take control of their life and work in an exciting industry with infinite possibilities.&nbsp;</p><p>Andrei promises you that there are no other courses out there as comprehensive and as well explained.&nbsp;<strong>He believes that in order to learn anything of value, you need to start with the foundation and develop the roots of the tree. Only from there will you be able to learn concepts and specific skills(leaves) that connect to the foundation. Learning becomes exponential when structured in this way.</strong>&nbsp;</p><p>Taking his experience in educational psychology and coding, Andrei's courses will take you on an understanding of complex subjects that you never thought would be possible.&nbsp;&nbsp; </p><p><strong>See you inside the courses!<br><br>--------<br><br>Yihua Zhang is one of the Instructors of Zero To Mastery, one of the highest rated and fastest growing Web Development academies on Udemy</strong>. He has been working as a software developer for numerous years in Toronto for some of the largest tech companies in the world. He has also been working as an instructor for more than a decade. He is focused on bringing everything he has learned to help you achieve a new career as a developer, but also give you all the fundamental skills required to flourish in this incredible industry.</p><p><br></p><p>Yihua is a self taught developer, so he fully understands the challenges and mindset of coming into this industry from various other backgrounds. He has been on both sides of the table, as both an instructor and student numerous times so he can empathize with the difficulty of learning something new and challenging. Learning itself is a skill that needs to be practiced and improved upon, and he is dedicated to helping you improve and master that skill for yourself. Courses need to be practical, you need to be able to understand why you are learning the things that you are being taught. You need to understand the problem before you know the solution, and he prides himself on teaching you how to build professional, real world applications so you truly understand why you are doing things a specific way. He will teach you the mindset and skillset required to grow as a developer as fast as possible, so you can have the rich and fulfilling life that comes with this career.</p><p><br></p><p>Yihua's courses will guide you to build beautifully written and richly featured applications, while truly understanding all the complex concepts you will encounter along the way.</p><p><br></p><p><br></p>",
    "headline": "Updated! Become a Senior React Developer. Build a massive E-commerce app with Redux, Hooks, GraphQL, Stripe, Firebase",
    "num_quizzes": 2,
    "num_lectures": 326
  },
  {
    "_class": "course",
    "id": 995016,
    "title": "Vue - The Complete Guide (incl. Router & Composition API)",
    "url": "/course/vuejs-2-the-complete-guide/",
    "image_240x135": "https://img-c.udemycdn.com/course/240x135/995016_ebf4_3.jpg",
    "description": "<p><strong>Join this bestselling Vue course to learn how to use the latest version of VueJS to build amazing, modern web apps!</strong></p><p>No matter at which metric you look at (Google Trends, Github Stars, Tweets ...) - <strong>VueJS is the shooting star</strong> in the world of JavaScript frameworks - <strong>it simply is amazing</strong>!</p><p>This bestselling course teaches the <strong>latest version of Vue</strong> (Vue.js 3)<strong> from the ground up</strong> and in great detail. We'll cover all the core basics but we'll not stop thereafter - this course also dives into advanced concepts like the Composition API introduced with Vue 3.</p><p>Frontend frameworks like Vue JS are <strong>extremely popular</strong> because they give us this reactive, great user experience we know from mobile apps - but now in the browser! No wonder that <strong>jobs</strong> requiring frontend framework skills like VueJS are amongst the <strong>best paid</strong> ones in the industry!</p><p>You may know Angular 2+ and ReactJS, well, <strong>VueJS combines the best of both frameworks</strong> and makes building anything from <strong>small widgets to big, enterprise-level apps</strong> a breeze and a whole lot of fun!</p><p>And if you don't know the two mentioned frameworks: That's fine, too, <strong>this course does not expect any knowledge</strong> of any other frontend framework - you will learn it all throughout this Course!</p><p><strong>This course covers it all!</strong></p><p>We'll start at the very basics, what Vue.js is and how it works before we move on to more complex and advanced topics but I'll be honest: It's too much to fit it all into one sentence, so here's what you'll learn in this Course:</p><ul><li><p><strong>What</strong> is VueJS and <strong>Why</strong> would you use it?</p></li><li><p>The <strong>Basics</strong> (including the basic Syntax, Understanding Templates and much more!)</p></li><li><p>How to Output <strong>Reactive Data</strong> &amp; Listen to <strong>Events</strong></p></li><li><p><strong>Interacting with DOM</strong> (Rendering Lists, Conditionally attaching/ detaching Elements ...)</p></li><li><p>Setting up a <strong>Development Environment</strong> and <strong>Workflow</strong></p></li><li><p>Using <strong>Components</strong> (and what Components are to begin with)</p></li><li><p>A <strong>Deep Dive Look Behind the Scenes</strong> of Vue</p></li><li><p>Binding to <strong>Form</strong> Inputs</p></li><li><p>Sending <strong>Http Requests</strong> to Backend APIs</p></li><li><p><strong>Authentication</strong> &amp; Vue</p></li><li><p>How to make your App more Beautiful with <strong>Animations</strong> and <strong>Transitions</strong></p></li><li><p>How to create an awesome <strong>Single-Page-Application</strong> (SPA) with <strong>Routing</strong></p></li><li><p>How to improve State Management by using <strong>Vuex</strong></p></li><li><p>How to <strong>Deploy</strong> the App</p></li><li><p><strong>And much more ...</strong></p></li></ul><p>All these topics are taught with<strong> real examples and demo projects.</strong> This course is full of exercises, challenges and bigger courser projects that allow you to practice what you learned.</p><p>Along with <strong>many other smaller projects</strong>, we will build a <strong>couple of bigger main projects</strong>:</p><ul><li><p>The <strong>\"Monster Slayer\" Game</strong> - a game running in the browser, 100% powered by Vue</p></li><li><p>The <strong>\"Learning Resource Manager\" </strong>- a web app that allows you to manage (add, delete, list) your favorite learning resources</p></li><li><p>The <strong>\"Find a Coach\" app</strong> - a web app that allows you to sign up / login, register as a coach, list and filter available coaches and send messages to coaches</p></li></ul><p><strong>Is this course for you?</strong></p><p>Now that you know what this course is about, let's see if this course is for you!</p><p><strong>Here are three types of students who will love this course:</strong></p><p><strong>Student #1:</strong></p><p>Has some JavaScript experience and is interested in what this language can do. You heard and read that JavaScript allows you to create nice web applications and enhance existing web pages. VueJS is your choice!</p><p><strong>Student #2:</strong></p><p>You already have some experience with other frontend frameworks like Angular (2+) or ReactJS. But either due to interest or disappointment of the existing frameworks, you seek some alternatives - VueJS might be what you were looking for!</p><p><strong>Student #3:</strong></p><p>Has experience with backend frameworks/ languages but now also wants to enter the frontend world. VueJS is an awesome choice here, it's fun, it uses native JS and it's extremely powerful!</p><p><strong>Bonus: Student #4</strong></p><p>Is disappointed by Angular 2+. Does a good framework need 2 hours of setup? No, certainly not - as VueJS will prove to this student!</p><p><strong>Let's dive into VueJS right now!</strong></p>",
    "headline": "Vue.js is an awesome JavaScript Framework for building Frontend Applications! VueJS mixes the Best of Angular + React!",
    "num_quizzes": 0,
    "num_lectures": 736
  },
  {
    "_class": "course",
    "id": 159070,
    "title": "Introduction to Web Development: HTML",
    "url": "/course/webdevelopment101_html/",
    "image_240x135": "https://img-b.udemycdn.com/course/240x135/159070_86f8_2.jpg",
    "description": "<p>  \t  This course is an overview of the HTML web programming standard.  The course is intended for those who have never done anything with HTML or web pages and would like to build this basic knowledge for starting a career as a web developer or for learning how to program HTML for web pages.  By no means will you be a world class UI developer at the end of this course, but you will have the basic understanding of building pages with HTML and HTML5, and at the end of the course you&#039;ll gain knowledge about where to go next to further your front-end web development skills  </p>",
    "headline": "Learn how to build web pages with HTML, including syntax, major elements, and new HTML5 features and capabilities. ",
    "num_quizzes": 0,
    "num_lectures": 54
  }
]
